package com.mycompany.carddeck;

// Перечисление Rank представляет достоинства карт.
enum Rank {
    ACE, // Достоинство "Туз".
    TWO, // Достоинство "Двойка".
    THREE, // Достоинство "Тройка".
    FOUR, // Достоинство "Четверка".
    FIVE, // Достоинство "Пятёрка".
    SIX, // Достоинство "Шестёрка".
    SEVEN, // Достоинство "Семёрка".
    EIGHT, // Достоинство "Восьмёрка".
    NINE, // Достоинство "Девятка".
    TEN, // Достоинство "Десятка".
    JACK, // Достоинство "Валет".
    QUEEN, // Достоинство "Дама".
    KING // Достоинство "Король".
}
